app/controllers/airlines_controller.rb

  def index
    render json: Airline.all
---
SELECT "airlines".* FROM "airlines"

  def show
    airline = Airline.find_by(user_id: params[:id])
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def create
    @user = User.find(params[:user_id])
    airline = @user.airlines.create(airline_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "airlines" ("name", "price", "location", "description", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"