app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
  def index
    ticket = Ticket.all

SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    ticket = Ticket.find_by(user_id: params[:id])

INSERT INTO "tickets" ("username", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", ""], ["city", ""], ["created_at", "2021-03-25 13:27:58.068196"], ["updated_at", "2021-03-25 13:27:58.068196"]]
---
  def create
    ticket = Ticket.new(ticket_params)

    if ticket.save

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 56]]
---
  def destroy
    ticket_id = Ticket.find(params[:id])
    ticket_id.destroy

    if ticket_id.destroy